package _06_Tsikly_Nachalo;
//2.	Написать программу, выводящую на экран только четные целые числа из диапазона от 1 до 100.
public class _06Program02 {
    public static void main(String[] args) {
        for (int i=2;i<=100;i=i+2)
            System.out.println(i);
    }
}
